{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "politics",
    "1": "Cinema",
    "2": "Football",
    "3": "tech",
    "4": "Literature",
    "5": "Stock Market",
    "6": "Tennis",
    "7": "Company News",
    "8": "General Sport",
    "9": "General Entertainment",
    "10": "Athletics",
    "11": "Music",
    "12": "Economy",
    "13": "Cricket",
    "14": "TV & Radio",
    "15": "Rugby",
    "16": "Mergers & Acquisitions",
    "17": "General Business",
    "18": "Theatre",
    "19": "Formula 1"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Athletics": 10,
    "Cinema": 1,
    "Company News": 7,
    "Cricket": 13,
    "Economy": 12,
    "Football": 2,
    "Formula 1": 19,
    "General Business": 17,
    "General Entertainment": 9,
    "General Sport": 8,
    "Literature": 4,
    "Mergers & Acquisitions": 16,
    "Music": 11,
    "Rugby": 15,
    "Stock Market": 5,
    "TV & Radio": 14,
    "Tennis": 6,
    "Theatre": 18,
    "politics": 0,
    "tech": 3
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "vocab_size": 30522
}
